Revit 2026 API

# GroundConductorSizeSetContains Method

---

Tests for the existence of a GroundConductorSize within the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual bool Contains(
	GroundConductorSize item
)
```
```vb
Public Overridable Function Contains (
	item As GroundConductorSize
) As Boolean
```
```cpp
public:
virtual bool Contains(
	GroundConductorSize^ item
)
```
```fsharp
abstract Contains :
        item : GroundConductorSize -> bool
override Contains :
        item : GroundConductorSize -> bool
```

#### Parameters

item GroundConductorSize
    The GroundConductorSize to be searched for.

#### Return Value

BooleanThe Contains method returns True if the GroundConductorSize is within the set, otherwise False.

#### Reference

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace